backend-keyboard/app/controllers/sounds_controller.rb

SELECT "sounds".* FROM "sounds"
---
  def index
    @sounds = Sound.all

INSERT INTO "sounds" ("sound_name", "filename", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sound_name", "Sound2"], ["filename", "no sound"], ["category_id", 4], ["created_at", "2020-06-18 08:47:53.698667"], ["updated_at", "2020-06-18 08:47:53.698667"]]
---
  def create
    @sound = Sound.new(sound_params)

    if @sound.save

SELECT "sounds".* FROM "sounds" WHERE "sounds"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_sound
      @sound = Sound.find(params[:id])