backend-keyboard/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("filename", "user_id", "created_at", "updated_at", "track_name") VALUES (?, ?, ?, ?, ?)  [["filename", "JSON.stringify(track)"], ["user_id", 8], ["created_at", "2020-06-17 18:40:18.142349"], ["updated_at", "2020-06-17 18:40:18.142349"], ["track_name", "beat 1"]]
---
  def create
    @track = Track.new(track_params)

    if @track.save

DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 4]]
---
  def destroy
    @track.destroy

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_track
      @track = Track.find(params[:id])