backend-keyboard/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "SauceBaucex"], ["created_at", "2020-06-17 16:09:33.830963"], ["updated_at", "2020-06-17 16:09:33.830963"]]